Revit 2024 API
CameraInfo.IsPespective Property
 Identifies whether the projection is orthographic or perspective
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsPespective { get; }
Visual Basic
Public ReadOnly Property IsPespective As Boolean
	Get
Visual C++
public:
property bool IsPespective {
	bool get ();
}
See Also
CameraInfo Class
Autodesk.Revit.DB Namespace